
class Stack {
    /**
     * предусмотреть возвожность создание стэка со значениями, если values передали
     * внутри использовать DoubleLinkedList
     * @param values
     */
    constructor(values) {

    }

    /**
     * возвращает значение с вершины с стэка
     * элемент при этом не удаляется
     */
    peak() {

    }

    /**
     * добавляет элемент в стэк
     * @param value
     */
    push(value) {

    }

    /**
     * удаляет элемент из стэка и возвращает значение
     * если стэк пустой - бросает ошибку
     */
    pop() {

    }

    /**
     * возвращает размер стэка
     */
    size() {

    }
}