
class Queue {
    /**
     * предусмотреть возвожность создание стэка со значениями, если values передали
     * использовать внутри DoubleLinkedList
     * @param values
     */
    constructor(values) {

    }

    /**
     * возвращает значение с вершины с стэка
     * элемент при этом не удаляется
     */
    enqueue() {

    }

    /**
     * добавляет элемент в стэк
     * @param value
     */
    dequeue(value) {

    }

    /**
     * возвращает размер стэка
     */
    size() {

    }
}